{
  "blogs": [
    {
      "title": "Dimuthu Blog",
      "body": "this is the blog body of the first blog",
      "author": "Dimuthu",
      "id": 1
    },
    {
      "title": "Ashen Blog",
      "body": "this is the blog body of the Third blog",
      "author": "Ashen",
      "id": 3
    },
    {
      "title": "BUILD YOUR CAREER PATH WITH A SUCCESSFUL PROJECT",
      "body": "Hello guys, I am Dimuthu Lakshan. I am an Undergraduate student and This is my second article about Self Career Development. If you wish to see the first part, Click Here to update your knowledge.\n\nAs a first step, I wanted to write technical things. That is why I wrote about Cloud Computing . When moving on, I realize that it is better to write how to develop your skills perfectly. Because I also didn’t know those stuff the early days. That is why I have decided to share my undergraduate working and learning experience with you. OK. Here it is.\n\nActually, I am here to say that it is not a very tough thing to do projects. Because I also thought like that my early days. Doing a project is a very interesting thing for me now. I love to do projects. Cause it is the best way to gain something new and update my knowledge with real-world examples.\n\nBefore moving on to the tips let's consider what is a project? and why a project is important? A project is a task series that should be completed to get the desired outcome. But in our case, we are expecting to learn something new and update our knowledge. That would be our main goal. When we consider why a project is important when you join with any organization you have to do projects and collaborate with new companions. You must have those abilities to work with a project.\n\nThis is my personal experience with my own projects and group projects. I think that you can also gain things through this article.\n\nOk. Let’s break down our topic into small parts. It is easy to understand what to do and how to do.\n\nDon’t think more. Start now\n\nAs a first step, we all are thinking about what to do. If we have confirmed what to do, then we are thinking about how to do it regularly. That is the main reason for getting failed with projects. We are imagining a huge picture of what to do. Then we do nothing that is expected. Think simple and do simple. When you are familiar with an ongoing project, you feel better than your beginning. Then you can imagine what you want to do and how to get the expected outcome from your project. So, don’t think more. Start now.\nNo need to be hurry to go deeper\nThis also is a very important thing with doing projects. Just try to do what you know. Then realize that you have an ability. Then you can go deep step by step. Because if you go deeper without prior experience, you will be feeling disappointed with I know nothing. That is why I suggest you do a simple thing and make yourself confident. Feel confident with your simple project. Cause it will be simple for others but it will be a huge turning point in your life. I also began like that. That is why I can highly recommend this step.\nBreakdown whole project into small pieces\n\nYou have heard this term beginning of this article. This is the workflow that can apply as a real example for our lives. Because it is easy to do and easy to understand break down huge things into small parts. As an example, now you can also understand very well this article because of the small pieces. That is why I suggest you break down your whole project as much as you want. And try to reach your small goals. Unknowingly you will be almost finishing your project.\nSet your timeline\n\nI have mentioned this fact in my first article. But let me explain here also. Try to create your own deadline for your project. And you should finish your work before the deadline with hard work. Because your timeline directs you to finish your project as soon as possible. Cause now you are willing to start other projects after finishing this.\nTry your best and care about the output\nIf this is your first project, you might careful with your output. Because everything you do depend on your output. In a simple term if the output is not your expected one try your best and dig more how to get the expected output. Get support from experts. There are lots of resources to get rid of these kinds of problems. The major thing is don’t give up and don’t panic. Try your best to get the expected outcome.\nComfortable with your expected outcome\n\nAs a final step. If you go through those steps, you will be able to finish your project successfully. You will be able to feel very comfortable. You can feel very confident with your ability. That is the thing you want to feel. When you feel like that, you are seeking opportunities for another project. If you haven’t felt that feeling in your life. Try to feel that feeling. I swear that It will be amazing.\nNow you have almost done your projects through these steps.\n\nI think that you can get something from this article. Your Comments are encouragement for me. Good Luck!\n\nSee you soon.",
      "author": "Dimuthu",
      "id": 4
    }
  ]
}