{
  "blogs": [
    {
      "title": "Dimuthu Blog",
      "body": "this is the blog body of the first blog",
      "author": "Dimuthu",
      "id": 1
    },
    {
      "title": "BUILD YOUR CAREER PATH WITH A SUCCESSFUL PROJECT",
      "body": "Hello guys, I am Dimuthu Lakshan. I am an Undergraduate student and This is my second article about Self Career Development. If you wish to see the first part, Click Here to update your knowledge.\n\nAs a first step, I wanted to write technical things. That is why I wrote about Cloud Computing . When moving on, I realize that it is better to write how to develop your skills perfectly. Because I also didn’t know those stuff the early days. That is why I have decided to share my undergraduate working and learning experience with you. OK. Here it is.\n\nActually, I am here to say that it is not a very tough thing to do projects. Because I also thought like that my early days. Doing a project is a very interesting thing for me now. I love to do projects. Cause it is the best way to gain something new and update my knowledge with real-world examples.\n\nBefore moving on to the tips let's consider what is a project? and why a project is important? A project is a task series that should be completed to get the desired outcome. But in our case, we are expecting to learn something new and update our knowledge. That would be our main goal. When we consider why a project is important when you join with any organization you have to do projects and collaborate with new companions. You must have those abilities to work with a project.\n\nThis is my personal experience with my own projects and group projects. I think that you can also gain things through this article.\n\nOk. Let’s break down our topic into small parts. It is easy to understand what to do and how to do.\n\nDon’t think more. Start now\n\nAs a first step, we all are thinking about what to do. If we have confirmed what to do, then we are thinking about how to do it regularly. That is the main reason for getting failed with projects. We are imagining a huge picture of what to do. Then we do nothing that is expected. Think simple and do simple. When you are familiar with an ongoing project, you feel better than your beginning. Then you can imagine what you want to do and how to get the expected outcome from your project. So, don’t think more. Start now.\nNo need to be hurry to go deeper\nThis also is a very important thing with doing projects. Just try to do what you know. Then realize that you have an ability. Then you can go deep step by step. Because if you go deeper without prior experience, you will be feeling disappointed with I know nothing. That is why I suggest you do a simple thing and make yourself confident. Feel confident with your simple project. Cause it will be simple for others but it will be a huge turning point in your life. I also began like that. That is why I can highly recommend this step.\nBreakdown whole project into small pieces\n\nYou have heard this term beginning of this article. This is the workflow that can apply as a real example for our lives. Because it is easy to do and easy to understand break down huge things into small parts. As an example, now you can also understand very well this article because of the small pieces. That is why I suggest you break down your whole project as much as you want. And try to reach your small goals. Unknowingly you will be almost finishing your project.\nSet your timeline\n\nI have mentioned this fact in my first article. But let me explain here also. Try to create your own deadline for your project. And you should finish your work before the deadline with hard work. Because your timeline directs you to finish your project as soon as possible. Cause now you are willing to start other projects after finishing this.\nTry your best and care about the output\nIf this is your first project, you might careful with your output. Because everything you do depend on your output. In a simple term if the output is not your expected one try your best and dig more how to get the expected output. Get support from experts. There are lots of resources to get rid of these kinds of problems. The major thing is don’t give up and don’t panic. Try your best to get the expected outcome.\nComfortable with your expected outcome\n\nAs a final step. If you go through those steps, you will be able to finish your project successfully. You will be able to feel very comfortable. You can feel very confident with your ability. That is the thing you want to feel. When you feel like that, you are seeking opportunities for another project. If you haven’t felt that feeling in your life. Try to feel that feeling. I swear that It will be amazing.\nNow you have almost done your projects through these steps.\n\nI think that you can get something from this article. Your Comments are encouragement for me. Good Luck!\n\nSee you soon.",
      "author": "Dimuthu",
      "id": 4
    },
    {
      "title": "BEING SUCCESSFUL WITH BEING A SELF TAUGHT PROGRAMMER.",
      "body": "As you already know self-learning is getting most popular method among all programmers and other people. But we know few people have got their results by self-learning. Because they all know the way that how to do self-learning effectively. Many people don’t know how to getting success through self-learning. This is a small guide to getting successful as a self-learner.\n\nIf you wish to see my previous post about cloud computing Click here to gain a little bit of knowledge about cloud computing.\n\nLet’s move on to the topic.\n\nAs an undergraduate student, I also have experience with self-learning. Because I have learned lots of things through self-learning. That is why I decided to write about some tips for self-learning. Early days I didn’t have an idea about self-learning. I just did what, seeing some tutorials and tried to do something on tutorials only. After one year, I had to check whether that what I know & what I don’t know. Unfortunately, what I don’t know side was at a higher level.\n\nWhile I am grieving, I wanted to learn things effectively. As a result of that, I have learned a lot in six months than my previous year. That is the way I have learned as a self-learner. Ok...✌ No need to talk more, let's look at the tips.\n\nUnderstanding basics\nWhen we move on to self-learning. It is required to understanding the basic things that you are learning. As an example, if you are trying to the web developer, you have to know key concepts of web development such as HTML (Hypertext Markup Language), CSS (Cascading Style Sheet) & JS(JavaScript). Another example if you are going to learn about CSS frameworks like bootstrap you have to have basic knowledge of how CSS works. That is why I recommend you to learn basic things about what you are learning.\nWork on a timeline\n\nThe reason to say this, if you are hands-on with the new thing let's think it is the programming language Java. You need to make a timeline like I will finish Java basics on that day(the day you are gonna finish it). It will be more reliable. Because of your mindset know I have to work on more. Because your mindset always saying that “I need to finish this before that day”. Your timeline directed you to do your works iteratively.\nFocusing on having a Mentor\nMentor will be directed you on how to conduct your works and what you should learn. If you are new to related fields, it is a good idea to having a mentor. A mentor does not have to be an expert in a particular field. The only thing that you have to consider is he knows about a particular field than you and also, he should be friendly and reliable. And he should be a person who thirsts for knowledge. Sometimes he is your friend. Because I also have a mentor. He is a friend of mine. But I think he doesn’t know that he is my mentor.\nReading books\nReading books is the most important thing in self-learning. My mentor taught me this habit too. When you are studying something, let’s say Java, you can read a book related to Java programming. At that time, you can be able to understand more about concepts. Because there are two ways that knowledge coming to you. And also, you can gain more knowledge about key concepts. Because most books include theory parts. Therefore, you can understand well the theories. There are lots of resources to read and download E-books. You can take some time from social media browsing to read a book. Then you will be an addict to read books. Early days I also lazy to read books. But now I am addicted to reading. Because there is a proverb\n“Reading completes the man”\n\nHands on to some projects\nWhen you are self-learning, you are well equipped with all the theories. You know how things going on. But you don’t have knowledge that how to apply that knowledge to the right place. Therefore, you need to apply your knowledge to the real-world project. If you have learned java you have to create some applications using java. Such as Student management system, security system, attendance system etc. When you are doing projects, you have to face lots of real-world problems. That is the point I wanna come. If you are facing problems you have to find solutions. There are communities like Stack overflow to learn and ask your questions. Using that kind of community, you can get rid of your problems. The main thing that I have to tell you, apply to the real world what you are learning. Then you can have the best idea about how to things going on and what thing needs.\nKanban Boards\nSometimes you have heard about the term Kanban. Kanban is a Japanese word it means “Signboard”. Kanban boards are using in project management. We can create our own Kanban board to manage our workflow. I am also using the Kanban board to manage my works. It is easy to identify what I have to do, what I am doing and what I have done so far. It is some kind of motivation for you. Because I am trying to increase the things that I have done. This is an example of the Kanban board. This is the simple one. If you are interested in the Kanban method. You can search more about Kanban boards.",
      "author": "Dimuthu",
      "id": 5
    }
  ]
}